# PART 1

In [2]:
import pandas as pd

## Membaca Data

In [3]:
df = pd.read_csv("C:/Users/bayuk/OneDrive/Documents/AI/pens/smtr2/Pemrosesan Data/2/penduduk_telepon_seluler_pedesaan.csv")
df

    nama_series;kode_wilayah;wilayah;tahun;nilai;target
0    Proporsi Penduduk yang Memiliki Telepon Selule...
1    Proporsi Penduduk yang Memiliki Telepon Selule...
2    Proporsi Penduduk yang Memiliki Telepon Selule...
3    Proporsi Penduduk yang Memiliki Telepon Selule...
4    Proporsi Penduduk yang Memiliki Telepon Selule...
..                                                 ...
520  Proporsi Penduduk yang Memiliki Telepon Selule...
521  Proporsi Penduduk yang Memiliki Telepon Selule...
522  Proporsi Penduduk yang Memiliki Telepon Selule...
523  Proporsi Penduduk yang Memiliki Telepon Selule...
524  Proporsi Penduduk yang Memiliki Telepon Selule...

[525 rows x 1 columns]

In [4]:
df = pd.read_csv("C:/Users/bayuk/OneDrive/Documents/AI/pens/smtr2/Pemrosesan Data/2/penduduk_telepon_seluler_pedesaan.csv", sep=";")
df.head()

,nama_series,kode_wilayah,wilayah,tahun,nilai,target
0,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2001,NaN,100.0
1,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2002,NaN,100.0
2,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2003,NaN,100.0
3,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2004,NaN,100.0
4,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2005,8.19,100.0

## Mengakses Baris
### loc

In [5]:
import numpy as np
df_shuffled = df.reindex(np.random.permutation(df.index))
df.head(3)

,nama_series,kode_wilayah,wilayah,tahun,nilai,target
0,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2001,NaN,100.0
1,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2002,NaN,100.0
2,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2003,NaN,100.0

In [6]:
df_shuffled.head(3)

,nama_series,kode_wilayah,wilayah,tahun,nilai,target
383,Proporsi Penduduk yang Memiliki Telepon Selule...,71,Sulawesi Utara,2009,48.23,NaN
75,Proporsi Penduduk yang Memiliki Telepon Selule...,15,Jambi,2001,NaN,NaN
427,Proporsi Penduduk yang Memiliki Telepon Selule...,74,Sulawesi Tenggara,2008,34.80,NaN

In [7]:
df_shuffled.iloc[0]

nama_series     Proporsi Penduduk yang Memiliki Telepon Selule...
kode_wilayah                                                   71
wilayah                                            Sulawesi Utara
tahun                                                        2009
nilai                                                       48.23
target                                                        NaN
Name: 383, dtype: object

In [8]:
df_shuffled.iloc[260]

nama_series     Proporsi Penduduk yang Memiliki Telepon Selule...
kode_wilayah                                                   74
wilayah                                         Sulawesi Tenggara
tahun                                                        2002
nilai                                                         NaN
target                                                        NaN
Name: 421, dtype: object

### loc

In [9]:
df_shuffled.head(3)

,nama_series,kode_wilayah,wilayah,tahun,nilai,target
383,Proporsi Penduduk yang Memiliki Telepon Selule...,71,Sulawesi Utara,2009,48.23,NaN
75,Proporsi Penduduk yang Memiliki Telepon Selule...,15,Jambi,2001,NaN,NaN
427,Proporsi Penduduk yang Memiliki Telepon Selule...,74,Sulawesi Tenggara,2008,34.80,NaN

In [10]:
df_shuffled.loc[0]

nama_series     Proporsi Penduduk yang Memiliki Telepon Selule...
kode_wilayah                                                    1
wilayah                                                 Indonesia
tahun                                                        2001
nilai                                                         NaN
target                                                      100.0
Name: 0, dtype: object

In [11]:
df_shuffled.loc[261]

nama_series     Proporsi Penduduk yang Memiliki Telepon Selule...
kode_wilayah                                                   51
wilayah                                                      Bali
tahun                                                        2007
nilai                                                        38.6
target                                                        NaN
Name: 261, dtype: object

In [12]:
df_shuffled.loc[260]

nama_series     Proporsi Penduduk yang Memiliki Telepon Selule...
kode_wilayah                                                   51
wilayah                                                      Bali
tahun                                                        2006
nilai                                                       27.22
target                                                        NaN
Name: 260, dtype: object

## Mengakses Sebagian Data (Range)

In [13]:
["wilayah", "tahun", "nilai"]

['wilayah', 'tahun', 'nilai']

In [14]:
subset_df = df[["wilayah", "tahun", "nilai"]]
subset_df.head()

     wilayah  tahun  nilai
0  Indonesia   2001    NaN
1  Indonesia   2002    NaN
2  Indonesia   2003    NaN
3  Indonesia   2004    NaN
4  Indonesia   2005   8.19

In [15]:
selected_columns = ["wilayah", "tahun"]
subset_df_2 = df[selected_columns]
subset_df_2.head()

     wilayah  tahun
0  Indonesia   2001
1  Indonesia   2002
2  Indonesia   2003
3  Indonesia   2004
4  Indonesia   2005

In [16]:
subset_rows = df.loc[[2, 0, 10]]
subset_rows.head()

,nama_series,kode_wilayah,wilayah,tahun,nilai,target
2,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2003,NaN,100.0
0,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2001,NaN,100.0
10,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2011,69.46,100.0

In [17]:
subset = df.loc[:, selected_columns]
subset

       wilayah  tahun
0    Indonesia   2001
1    Indonesia   2002
2    Indonesia   2003
3    Indonesia   2004
4    Indonesia   2005
..         ...    ...
520      Papua   2011
521      Papua   2012
522      Papua   2013
523      Papua   2014
524      Papua   2015

[525 rows x 2 columns]

In [18]:
subset = df.loc[3:5, selected_columns]
subset

     wilayah  tahun
3  Indonesia   2004
4  Indonesia   2005
5  Indonesia   2006

In [19]:
subset = df.loc[df["tahun"] == 2004, selected_columns]
subset.head()

           wilayah  tahun
3        Indonesia   2004
18            Aceh   2004
33  Sumatera Utara   2004
48  Sumatera Barat   2004
63            Riau   2004

In [20]:
subset["tahun"].unique()

array([2004], dtype=int64)

In [21]:
subset["tahun"].nunique()

1

In [22]:
df[df["nilai"].isnull()].head()

,nama_series,kode_wilayah,wilayah,tahun,nilai,target
0,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2001,NaN,100.0
1,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2002,NaN,100.0
2,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2003,NaN,100.0
3,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2004,NaN,100.0
15,Proporsi Penduduk yang Memiliki Telepon Selule...,11,Aceh,2001,NaN,NaN

In [23]:
df[~df["nilai"].isnull()].head()

,nama_series,kode_wilayah,wilayah,tahun,nilai,target
4,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2005,8.19,100.0
5,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2006,12.27,100.0
6,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2007,24.33,100.0
7,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2008,38.15,100.0
8,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2009,49.21,100.0

## Mengeksplor Data

In [24]:
df.shape

(525, 6)

In [25]:
df.describe()

       kode_wilayah        tahun       nilai  target
count    525.000000   525.000000  361.000000    15.0
mean      46.228571  2008.000000   53.558172   100.0
std       26.902161     4.324614   28.889846     0.0
min        1.000000  2001.000000    1.270000   100.0
25%       18.000000  2004.000000   25.870000   100.0
50%       51.000000  2008.000000   60.890000   100.0
75%       72.000000  2012.000000   80.230000   100.0
max       94.000000  2015.000000   94.050000   100.0

In [26]:
df["wilayah"].describe()

count           525
unique           35
top       Indonesia
freq             15
Name: wilayah, dtype: object

In [27]:
df["wilayah"].unique()

array(['Indonesia', 'Aceh', 'Sumatera Utara', 'Sumatera Barat', 'Riau',
       'Jambi', 'Sumatera Selatan', 'Bengkulu', 'Lampung',
       'Kepulauan Bangka Belitung', 'Kepulauan Riau', 'DKI Jakarta',
       'Jawa Barat', 'Jawa Tengah', 'DI Yogyakarta', 'Jawa Timur',
       'Banten', 'Bali', 'Nusa Tenggara Barat', 'Nusa Tenggara Timur',
       'Kalimantan Barat', 'Kalimantan Tengah', 'Kalimantan Selatan',
       'Kalimantan Timur', 'Kalimantan Utara', 'Sulawesi Utara',
       'Sulawesi Tengah', 'Sulawesi Selatan', 'Sulawesi Tenggara',
       'Gorontalo', 'Sulawesi Barat', 'Maluku', 'Maluku Utara',
       'Papua Barat', 'Papua'], dtype=object)

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525 entries, 0 to 524
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nama_series   525 non-null    object
 1   kode_wilayah  525 non-null    int64
 2   wilayah       525 non-null    object
 3   tahun         525 non-null    int64
 4   nilai         361 non-null    float64
 5   target        15 non-null     float64
dtypes: float64(2), int64(2), object(2)
memory usage: 24.7+ KB

## Mengganti Tipe Kolom

In [29]:
df["tahun"] = df["tahun"].astype("str")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525 entries, 0 to 524
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nama_series   525 non-null    object
 1   kode_wilayah  525 non-null    int64
 2   wilayah       525 non-null    object
 3   tahun         525 non-null    object
 4   nilai         361 non-null    float64
 5   target        15 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 24.7+ KB

In [31]:
df = pd.read_csv("C:/Users/bayuk/OneDrive/Documents/AI/pens/smtr2/Pemrosesan Data/2/penduduk_telepon_seluler_pedesaan.csv", sep=";",
dtype={"tahun": str, "kode_wilayah": str})
df.head()

,nama_series,kode_wilayah,wilayah,tahun,nilai,target
0,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2001,NaN,100.0
1,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2002,NaN,100.0
2,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2003,NaN,100.0
3,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2004,NaN,100.0
4,Proporsi Penduduk yang Memiliki Telepon Selule...,1,Indonesia,2005,8.19,100.0

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525 entries, 0 to 524
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nama_series   525 non-null    object
 1   kode_wilayah  525 non-null    object
 2   wilayah       525 non-null    object
 3   tahun         525 non-null    object
 4   nilai         361 non-null    float64
 5   target        15 non-null     float64
dtypes: float64(2), object(4)
memory usage: 24.7+ KB